# TEST TP1

In [2]:
import pandas as pd
df_a = pd.DataFrame({'Name':["Alejo","Fede","Facu"],'Sex':["M","M","M"]})
df_b = pd.DataFrame({'Name':["Alejo","Alejo","Fede","Fede","Facu"],'Edu':["Secundario","Tecnico","Secundario","Tecnico","Secundario"]})

In [5]:
df_a

    Name Sex
0  Alejo   M
1   Fede   M
2   Facu   M

In [6]:
df_b

          Edu   Name
0  Secundario  Alejo
1     Tecnico  Alejo
2  Secundario   Fede
3     Tecnico   Fede
4  Secundario   Facu

In [8]:
res = df_a.merge(df_b, on='Name')

In [18]:
res

    Name Sex         Edu
0  Alejo   M  Secundario
1  Alejo   M     Tecnico
2   Fede   M  Secundario
3   Fede   M     Tecnico
4   Facu   M  Secundario

In [10]:
postulantes_educacion = pd.read_csv('TP/datos/fiuba_1_postulantes_educacion.csv')
postulantes_genero = pd.read_csv('TP/datos/fiuba_2_postulantes_genero_y_edad.csv')
visitas = pd.read_csv('TP/datos/fiuba_3_vistas.csv')
postulaciones = pd.read_csv('TP/datos/fiuba_4_postulaciones.csv')
avisos = pd.read_csv('TP/datos/fiuba_5_avisos_online.csv')
avisos_detalles = pd.read_csv('TP/datos/fiuba_6_avisos_detalle.csv')